app/views/students/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('Student') ORDER BY id desc LIMIT 10 OFFSET 0
---

      <% @students.class_rooms.first.users.where("type= 'student'").each do |tc| %>