app/controllers/class_rooms_controller.rb

SELECT  `class_rooms`.* FROM `class_rooms` ORDER BY id desc LIMIT 10 OFFSET 0
---
  def index
    @class_rooms = ClassRoom.page(params[:page] || 1).per_page(params[:per_page] || 10).
      order("id desc")

INSERT INTO `class_rooms` (`roomname`, `created_at`, `updated_at`) VALUES ('移动三班', '2017-04-05 02:47:34', '2017-04-05 02:47:34')
---
  def create
    @class_room = current_user.class_rooms.new(class_room_attrs)
    if @class_room.save