app/controllers/users_controller.rb

def create
    @user = User.new
    if params[:user][:mold] == "student"
         @student = Student.new(user_attrs)
         if @student.save
---
INSERT INTO `users` (`username`, `created_at`, `updated_at`, `crypted_password`, `salt`, `mold`, `type`) VALUES ('张文英', '2017-04-01 11:11:21', '2017-04-01 11:11:21', 'bce678f69eed6a13b19a5137efc6e661b1a35159f54459aa32075d5f9b2adff0', '1491045081', 'teacher', 'Teacher')